; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_2 ?v7 - type_1 ?v2 - type_3)
 	      (pred_3 ?v5 - object ?v2 - type_3)
	      (pred_1 ?v7 - type_1 ?v8 - type_2)
	      (pred_4 ?v7 - type_1 ?v5 - object ?v8 - type_2))

   (:action op_2
       :parameters  (?v7 - type_1 ?v6 ?v1 - type_3)
       :precondition (and  (pred_2 ?v7 ?v6))
       :effect (and  (pred_2 ?v7 ?v1)
		     (not (pred_2 ?v7 ?v6))))

   (:action op_1
       :parameters (?v7 - type_1 ?v4 - object ?v3 - type_3 ?v8 - type_2)
       :precondition  (and  (pred_3 ?v4 ?v3) (pred_2 ?v7 ?v3) (pred_1 ?v7 ?v8))
       :effect (and (pred_4 ?v7 ?v4 ?v8)
		    (not (pred_3 ?v4 ?v3)) 
		    (not (pred_1 ?v7 ?v8))))

   (:action op_3
       :parameters (?v7 - type_1 ?v4 - object ?v3 - type_3 ?v8 - type_2)
       :precondition  (and  (pred_4 ?v7 ?v4 ?v8) (pred_2 ?v7 ?v3))
       :effect (and (pred_3 ?v4 ?v3)
		    (pred_1 ?v7 ?v8)
		    (not (pred_4 ?v7 ?v4 ?v8)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_11 obj_06 - type_1
obj_01 obj_10 obj_03 obj_13 - type_2
obj_08 obj_05 obj_02 obj_09 - type_3
obj_14 obj_12 obj_07 obj_04 - object)
(:init
(pred_2 obj_11 obj_02)
(pred_1 obj_11 obj_01)
(pred_1 obj_11 obj_10)
(pred_2 obj_06 obj_05)
(pred_1 obj_06 obj_03)
(pred_1 obj_06 obj_13)
(pred_3 obj_14 obj_08)
(pred_3 obj_12 obj_02)
(pred_3 obj_07 obj_05)
(pred_3 obj_04 obj_02)
)
(:goal
(and
(pred_3 obj_14 obj_08)
(pred_3 obj_12 obj_08)
(pred_3 obj_07 obj_05)
(pred_3 obj_04 obj_08)
)
)

(:constraints
  (always (not (pred_2 obj_11 obj_08)))
)
)

; plan
1. (op_1 obj_11 obj_12 obj_02 obj_10)
   deleted: (pred_3 obj_12 obj_02) (pred_1 obj_11 obj_10)
   added: (pred_4 obj_11 obj_12 obj_10)
   goals met: 2 of 4
2. (op_2 obj_06 obj_05 obj_02)
   deleted: (pred_2 obj_06 obj_05)
   added: (pred_2 obj_06 obj_02)
   goals met: 2 of 4
3. (op_1 obj_06 obj_04 obj_02 obj_13)
   deleted: (pred_3 obj_04 obj_02) (pred_1 obj_06 obj_13)
   added: (pred_4 obj_06 obj_04 obj_13)
   goals met: 2 of 4
4. (op_2 obj_06 obj_02 obj_08)
   deleted: (pred_2 obj_06 obj_02)
   added: (pred_2 obj_06 obj_08)
   goals met: 2 of 4
5. (op_3 obj_06 obj_04 obj_08 obj_13)
   deleted: (pred_4 obj_06 obj_04 obj_13)
   added: (pred_3 obj_04 obj_08) (pred_1 obj_06 obj_13)
   goals met: 3 of 4
6. (op_2 obj_06 obj_08 obj_02)
   deleted: (pred_2 obj_06 obj_08)
   added: (pred_2 obj_06 obj_02)
   goals met: 3 of 4
7. (op_3 obj_11 obj_12 obj_02 obj_10)
   deleted: (pred_4 obj_11 obj_12 obj_10)
   added: (pred_3 obj_12 obj_02) (pred_1 obj_11 obj_10)
   goals met: 3 of 4
8. (op_1 obj_06 obj_12 obj_02 obj_13)
   deleted: (pred_3 obj_12 obj_02) (pred_1 obj_06 obj_13)
   added: (pred_4 obj_06 obj_12 obj_13)
   goals met: 3 of 4
9. (op_2 obj_06 obj_02 obj_08)
   deleted: (pred_2 obj_06 obj_02)
   added: (pred_2 obj_06 obj_08)
   goals met: 3 of 4
10. (op_3 obj_06 obj_12 obj_08 obj_13)
   deleted: (pred_4 obj_06 obj_12 obj_13)
   added: (pred_3 obj_12 obj_08) (pred_1 obj_06 obj_13)
   goals met: 4 of 4
